Австралия/src/AccumulationRegisters/ManufacturingProcessSupply/ManufacturingProcessSupply.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ManufacturingProcessSupply</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Required</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>TransferredToProduction</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Scheduled</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Produced</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Reference</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Specification</name>
    <type>
      <types>CatalogRef.BillsOfMaterials</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/ManufacturingProcessSupply/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
		Or Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	ManufacturingProcessSupply.LineNumber AS LineNumber,
	|	ManufacturingProcessSupply.Reference AS Reference,
	|	ManufacturingProcessSupply.Products AS Products,
	|	ManufacturingProcessSupply.Characteristic AS Characteristic,
	|	ManufacturingProcessSupply.Specification AS Specification,
	|	ManufacturingProcessSupply.Required AS Required,
	|	ManufacturingProcessSupply.TransferredToProduction AS TransferredToProduction,
	|	ManufacturingProcessSupply.Scheduled AS Scheduled,
	|	ManufacturingProcessSupply.Produced AS Produced
	|INTO RegisterManufacturingProcessSupplyChange
	|FROM
	|	AccumulationRegister.ManufacturingProcessSupply AS ManufacturingProcessSupply");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsManufacturingProcessSupplyChange", False);
	
EndProcedure

#EndRegion

#EndIf
